package ua.i.mail100.builder2;

/*
* Інтерфейс будівельника оголошує кроки конструювання продуктів, спільні для всіх видів будівельників
* Конкретні будівельники реалізують кроки будівництва, кожен по-своєму.
  Конкретні будівельники можуть виготовляти різнорідні об’єкти, що не мають спільного інтерфейсу.
* Продукт — об’єкт, що створюється. Продукти, зроблені різними будівельниками, не зобов’язані мати спільний інтерфейс
* Директор визначає порядок виклику кроків будівельників, необхідних для виробництва продуктів тієї чи іншої конфігурації
* Зазвичай Клієнт подає до конструктора директора вже готовий об’єкт-будівельник, а директор надалі використовує тільки його.
  Але можливим є також інший варіант, коли клієнт передає  будівельника через параметр будівельного методу директора.
  У такому випадку можна щоразу використовувати різних будівельників для виробництва різноманітних відображень об’єктів.
*/

public class Runner {
}
